{"slug":"automate-macos-preferences","title":"Automate all of MacOS configuration with Defaults&PlistBuddy, AppleScript and pmset","pubdate":"2020-03-09","html":"<ul>\n<li>I wrote similar things <a href=\"https://github.com/ryuta69/dotfiles/issues/5\">here</a> in Japanese.</li>\n</ul>\n<p>When I cleaning <a href=\"https://github.com/ryuta69/dotfiles\">dotfiles</a>, I thought I could automate all macos configuration as well such as not only defaults simple command but also Dock applications. Then, I achieve that so I wrote it down here.</p>\n<h2 id=\"defaults\">defaults</h2>\n<p>If you develop with macos, you might have seen defaults command at least onse. The command below shows an configurations not to generate DS_STORE the Finder display setting files on Shared directory or USB.</p>\n<pre><code>defaults write com.apple.desktopservices DSDontWriteUSBStores -bool true\ndefaults write com.apple.desktopservices DSDontWriteNetworkStores -bool true</code></pre>\n<p>defaluts command is doing the reference, add, update, and delete on Mac system preferences like below.</p>\n<pre><code>defaults order[read(reference)/write(add/update)/delete(delete)] domain[Mac configuration items array. I wrote lists below] The valid setting items on domain[I wrote lists below] value[-Type Value] </code></pre>\n<p>If you like to show all the list of domain, you could type like this.</p>\n<pre><code>defaults domains | sed &#39;s/ /\\n/g&#39;\n# alternative\nls ~/Library/Preferences | sed &#39;s/.plist$//g&#39;</code></pre>\n<p>As you see the second command, plist files under ~/Library/Preferences are the configuration files. They set those files in each user folders. Sometimes you have directory such as ByHost, and it controlos Trackpad or something relate to Hardware, you need to change the command like <code>defaults -currentHost write</code>. Some exceptions exist but this is the standard.</p>\n<h3 id=\"check-what-configurations-are-assigned-to-plist\">check what configurations are assigned to plist</h3>\n<p>This is the hardest things on this way. Apple never opened the document about it, we need to find out by ourselves. There a site called defaults-write.com opens the list, however, they are too old and not fine with mojaves or latter. It doesn&#39;t list by category so hard to check, anyway.</p>\n<p>Then I searched a hell and found out this repository.\n<a href=\"https://github.com/tech-otaku/macos-config-mojave/blob/master/macos-config.sh\">https://github.com/tech-otaku/macos-config-mojave/blob/master/macos-config.sh</a></p>\n<p>This was life-changing. I felt like I found the treasure and really influenced by this. I appreciate this that I have started everything from this repository. Although this repository doesn&#39;t give us a all informations such as Trackpad, this helps a lot to start by myself from here.</p>\n<p>I need to search by myself so I choose this way. Changing some system preferences and search diff like this.</p>\n<pre><code># rg is ripgrep, you can replace it with grep.\nalias -G TA=&#39;&gt; ~/work/temp/a.log&#39;\nalias -G TB=&#39;&gt; ~/work/temp/b.log&#39;\nalias dflg=&#39;diff ~/work/temp/a.log ~/work/temp/b.log&#39;\nls *.plist | defaults read -TA\nls *.plist | defaults read -TB\nDPNT=dflg\n\nls | xargs -I % sh -c &#39;echo % &amp;&amp; defaults read %&#39; | rg &#39;${DPNT}|plist&#39;</code></pre>\n<p>It&#39;s stable and the finest way, I guess.</p>\n<h2 id=\"3-configurations-which-cant-be-done-by-defaults\">3 configurations which can&#39;t be done by defaults</h2>\n<p>For example, Energy Saver is not referenced and assign inside plist. These changes are set inside sfl2 which is binary files and can&#39;t be controlled. Also, Applications in Dock are not controllable because they are deeply nested dict. </p>\n<h3 id=\"pmset\">pmset</h3>\n<p>Energy Saver can be controlled by pmset. It&#39;s a wrapper of macos configurations and compile it to sfl2.</p>\n<pre><code>pmset -c displaysleep 3</code></pre>\n<h3 id=\"plistbuddy\">PlistBuddy</h3>\n<p>Also defaults can&#39;t access deeper than 1 depth nest, while PlistBuddy can control any type of plist files.</p>\n<pre><code>/usr/libexec/PlistBuddy -c &quot;Set :DesktopViewSettings:IconViewSettings:textSize 12&quot; ~/Library/Preferences/com.apple.finder.plist</code></pre>\n<p>In this way, you can controll any structures like comibined with bash. You can grep to findout, or calculate the length of array, and for-index to add array with Plist.</p>\n<p><a href=\"https://github.com/ryuta69/dotfiles/blob/master/system/lib/dockitem.zsh\">https://github.com/ryuta69/dotfiles/blob/master/system/lib/dockitem.zsh</a></p>\n<h2 id=\"applescript-to-set-with-gui-and-impossible-items-on-terminal\">AppleScript to set with GUI and impossible items on terminal</h2>\n<p>This is the hardest thing. I had written a <a href=\"https://qiita.com/ryuta69/items/c84501993635c72540a7\">Selenium article</a> before, beside it is similar as Automation of GUI scripting in MacOS.</p>\n<p>Since you created the script, you can build an app with Automator, but it kind of not my goal to automate with CUI, so I skipped. They all will work with osascript.</p>\n<h3 id=\"lets-try-just-open-system-preferences\">let&#39;s try just open system preferences</h3>\n<pre><code>tell application &quot;System Preferences&quot;\n    activate\nend tell</code></pre>\n<p>Put this in Script Editor in default MacOS editor. You can name as test.applescript and exec as osascript, but it doesn&#39;t stdout data. You can shell command inside to print out, but it&#39;s allowed to exec shell command once in the script. (I didn&#39;t know about this )</p>\n<p>Run it, and you&#39;ll be sure you are seeing System Preferences panel. You can command any Applications to boost with Applescript. Let&#39;s see General Preferences next.</p>\n<pre><code>tell application &quot;System Preferences&quot;\n    activate\n  reveal pane id &quot;com.apple.preference.general&quot;\nend tell</code></pre>\n<p>Pane means a series of root System Preferenes. It&#39;s assined with domain as you look at its name. I will list all domains later, now let&#39;s go next step to control them.</p>\n<pre><code>tell application &quot;System Preferences&quot;\n    activate\n    reveal pane id &quot;com.apple.preference.general&quot;\nend tell\ntell application &quot;System Events&quot;\n    tell application process &quot;System Preferences&quot;\n        repeat while not (window 1 exists)\n        end repeat\n        tell window &quot;General&quot;\n            tell pop up button 3\n                delay 1\n                click\n            end tell\n        end tell\n    end tell\nend tell\nquit application &quot;System Preferences&quot;</code></pre>\n<p>Did you get the menu of default browser? A <code>System Events</code> is an integrated function of Applescript which could interactive control such as click or keytype on Activated elements.</p>\n<h3 id=\"to-list-all-the-elements-on-applescript\">to list all the elements on applescript</h3>\n<p>It&#39;s life changing, and this is what I like to tell the most in this article.</p>\n<p>pane</p>\n<pre><code>tell application &quot;System Preferences&quot;\n    name of panes\nend tell</code></pre>\n<p>anchor</p>\n<pre><code>tell application &quot;System Preferences&quot;\n  reveal pane id &quot;com.apple.preference.general&quot;\n  get name of every anchor\nend tell</code></pre>\n<p>the items in active pane</p>\n<pre><code>tell application &quot;System Preferences&quot;\n    activate\n    reveal pane id &quot;com.apple.preference.general&quot;\nend tell\ntell application &quot;System Events&quot;\n    tell application process &quot;System Preferences&quot;\n        repeat while not (window 1 exists)\n        end repeat\n        tell window &quot;General&quot;\n            every UI element\n        end tell\n    end tell\nend tell</code></pre>\n<h3 id=\"lets-make-some-scripts\">let&#39;s make some scripts</h3>\n<p>You could choose default browser, and input sources with this.</p>\n<p><a href=\"https://github.com/ryuta69/dotfiles/tree/master/system/lib\">https://github.com/ryuta69/dotfiles/tree/master/system/lib</a></p>\n<p>GUI settings and third party applications are now able to automate, I now finally can say I automate everything on MacOS.</p>\n<h2 id=\"summary\">summary</h2>\n<p>I&#39;m now confident with this script. I searched every other&#39;s script allday and everyday, and enhance myown for two month.</p>\n<p>Now I can use script editor, and select domains to search with it, but at first time there is no document, so I was struggling with a few informations and about core settings which is really hard to find. But those times are kind of fun and I really got enthusiatic about it.</p>\n<p>After all, I found myself really is a kind of person who is motivated with <strong>effective production</strong>. I used to speedrun gamers, and that time is like I didn&#39;t sleep, eat or talk with anyone. I got really absorbed in it and make script with it and find a bug to make breakthrough.....all for making time short, not dependence on people(make rule and reproductive), and beautiful to be proud. Now, I&#39;m programmer and doing kind of similar thing.</p>\n<p>It&#39;s like studying others deeply, forget anything but itself, not sleeping nore eating, think how to appeal myself and beautiful, and make it reproductive and limit of effective to say this is perfect.</p>\n"}